# YOLO11-OBB with CBAM (Stable Version)
nc: 2
reg_max: 16
scales:
  n: [0.50, 0.25, 1024] 

backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]  # 2
  - [-1, 1, MobileNetBlock, []] # 3-MobileNet block
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 6, C2f, [256, True]]  # 5
  - [-1, 1, MobileNetBlock, []] # 6-MobileNet block
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
  - [-1, 6, C2f, [512, True]]  # 8
  - [-1, 1, Conv, [1024, 3, 2]] # 9-P5/32
  - [-1, 3, C2f, [1024, True]] # 10
  - [-1, 1, CBAM, [1024]]      # 11-注意力过滤
  - [-1, 1, SPPF, [1024, 5]]   # 12

# ... backbone 部分保持不变 ...

head:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 8], 1, Concat, [1]]  # 14
  - [-1, 3, C2f, [512]]        # 15
  - [-1, 1, CBAM, [512]]       # 16

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 5], 1, Concat, [1]]  # 18
  - [-1, 3, C2f, [256]]        # 19
  - [-1, 1, CBAM, [256]]       # 20

  - [-1, 1, Conv, [256, 3, 2]] # 21
  - [[-1, 16], 1, Concat, [1]] # 22
  - [-1, 3, C2f, [512]]        # 23

  - [-1, 1, Conv, [512, 3, 2]] # 24
  - [[-1, 12], 1, Concat, [1]] # 25
  - [-1, 3, C2f, [1024]]       # 26

  - [[20, 23, 26], 1, OBB26, [nc, 1]]